#!/bin/bash
#
##################################################################################################################
# Written to be used on 64 bits computers
# Author 	: 	Temur Yunusov
#       	: 	https://www.digitalocean.com/community/tutorials/how-to-install-ruby-on-rails-with-rbenv-on-ubuntu-18-04
##################################################################################################################
##################################################################################################################
#
#   DO NOT JUST RUN THIS. EXAMINE AND JUDGE. RUN AT YOUR OWN RISK.
#
##################################################################################################################

echo "##############################################################################"
echo "############# Clone the rbenv repository from GitHub       ###################"
echo "##############################################################################"

git clone https://github.com/rbenv/rbenv.git ~/.rbenv

echo "#############################################################################################"
echo "###### bashrc, отредактируйте чтобы эта настройка сохранилась и для следующих сессий     ####"
echo "#############################################################################################"

# Добавьте ~/.rbenv/bin в переменную $PATH, чтобы получить доступ к утилите командной строки rbenv. 
# Отредактируйте файл ~/.bashrc, чтобы эта настройка сохранилась и для следующих сессий.
read -d '' String <<"EOF"
# rbenv
export PATH="$HOME/.rbenv/bin:$PATH"
eval "$(rbenv init -)"
EOF

# Save to ~/.bashrc
echo -e "\n${String}" >> ~/.bashrc

# Enable rbenv for current shell
eval "${String}"

# Install ruby-build as an rbenv plugin, adds `rbenv install` command
git clone https://github.com/rbenv/ruby-build.git ~/.rbenv/plugins/ruby-build

echo "###########################################################################"
echo "###################    rbenv installed  ###################################"
echo "###########################################################################"